Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://gogulamanikanta11.github.io/PantryMobileApp/"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Ramp up phase
    - duration: 180
      arrivalRate: 100
      name: Sustained load phase
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Homepage Access Load"
    flow:
      - get:
          url: "/"
